## Data Cleansing and Transformation using the Mode method:

### Importing Libraries:

In [132]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

In [69]:
data1 = pd.read_excel(r'C:\Users\Jyothi Nair\Desktop\Data Glacier\bank-additional.xlsx')

In [70]:
data2 = pd.read_excel(r'C:\Users\Jyothi Nair\Desktop\Data Glacier\bank-additional-full.xlsx')

### Dealing with null values:

In [71]:
data1.head()

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,30,blue-collar,married,basic.9y,no,yes,no,cellular,may,fri,...,2,999,0,nonexistent,-1.8,92.893,-46.2,1.313,5099.1,no
1,39,services,single,high.school,no,no,no,telephone,may,fri,...,4,999,0,nonexistent,1.1,93.994,-36.4,4.855,5191.0,no
2,25,services,married,high.school,no,yes,no,telephone,jun,wed,...,1,999,0,nonexistent,1.4,94.465,-41.8,4.962,5228.1,no
3,38,services,married,basic.9y,no,unknown,unknown,telephone,jun,fri,...,3,999,0,nonexistent,1.4,94.465,-41.8,4.959,5228.1,no
4,47,admin.,married,university.degree,no,yes,no,cellular,nov,mon,...,1,999,0,nonexistent,-0.1,93.200,-42.0,4.191,5195.8,no

In [72]:
data2.head()

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56,housemaid,married,basic.4y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
1,57,services,married,high.school,unknown,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
2,37,services,married,high.school,no,yes,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
3,40,admin.,married,basic.6y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
4,56,services,married,high.school,no,no,yes,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no

In [73]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4119 entries, 0 to 4118
Data columns (total 21 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             4119 non-null   int64
 1   job             4119 non-null   object
 2   marital         4119 non-null   object
 3   education       4119 non-null   object
 4   default         4119 non-null   object
 5   housing         4119 non-null   object
 6   loan            4119 non-null   object
 7   contact         4119 non-null   object
 8   month           4119 non-null   object
 9   day_of_week     4119 non-null   object
 10  duration        4119 non-null   int64
 11  campaign        4119 non-null   int64
 12  pdays           4119 non-null   int64
 13  previous        4119 non-null   int64
 14  poutcome        4119 non-null   object
 15  emp.var.rate    4119 non-null   float64
 16  cons.price.idx  4119 non-null   float64
 17  cons.conf.idx   4119 non-null   float64
 18  euribor3m       4119 non-null   float64
 19  nr.employed     4119 non-null   float64
 20  y               4119 non-null   object
dtypes: float64(5), int64(5), object(11)
memory usage: 675.9+ KB

In [74]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41188 entries, 0 to 41187
Data columns (total 21 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             41188 non-null  int64
 1   job             41188 non-null  object
 2   marital         41188 non-null  object
 3   education       41188 non-null  object
 4   default         41188 non-null  object
 5   housing         41188 non-null  object
 6   loan            41188 non-null  object
 7   contact         41188 non-null  object
 8   month           41188 non-null  object
 9   day_of_week     41188 non-null  object
 10  duration        41188 non-null  int64
 11  campaign        41188 non-null  int64
 12  pdays           41188 non-null  int64
 13  previous        41188 non-null  int64
 14  poutcome        41188 non-null  object
 15  emp.var.rate    41188 non-null  float64
 16  cons.price.idx  41188 non-null  float64
 17  cons.conf.idx   41188 non-null  float64
 18  euribor3m       41188 non-null  float64
 19  nr.employed     41188 non-null  float64
 20  y               41188 non-null  object
dtypes: float64(5), int64(5), object(11)
memory usage: 6.6+ MB

As the total number of entries match the non-null values for each column, there are no null values to be found.

### Imputation of missing values:

In [75]:
missing1 = [var for var in data1.columns if data1[var].dtypes == 'O']
missing2 = [var for var in data2.columns if data2[var].dtypes == 'O']

The above statements check for categorical datatypes in our datasets. 'O' is used to check for object datatypes.

In [76]:
missing1

['job',
 'marital',
 'education',
 'default',
 'housing',
 'loan',
 'contact',
 'month',
 'day_of_week',
 'poutcome',
 'y']

In [77]:
missing2

['job',
 'marital',
 'education',
 'default',
 'housing',
 'loan',
 'contact',
 'month',
 'day_of_week',
 'poutcome',
 'y']

We see that both datasets have the same categorical datatypes.

### Imputing missing values using Mode:

Using the mode function, we find out what the most common occurance is for each of these datatypes, and then replace all unknown values with the mode.

In [93]:
data1['job'].mode()

0    admin.
dtype: object

In [102]:
data2['job'].mode()

0    admin.
dtype: object

In [89]:
data1['job'].replace('unknown', 'admin', inplace = True)
data2['job'].replace('unknown', 'admin', inplace = True)

In [101]:
data1['marital'].mode()

0    married
dtype: object

In [103]:
data2['marital'].mode()

0    married
dtype: object

In [104]:
data1['marital'].replace('unknown', 'married', inplace = True)
data2['marital'].replace('unknown', 'married', inplace = True)

In [105]:
data1['default'].mode()

0    no
dtype: object

In [106]:
data2['default'].mode()

0    no
dtype: object

In [107]:
data1['default'].replace('unknown', 'no', inplace = True)
data2['default'].replace('unknown', 'no', inplace = True)

In [108]:
data1['housing'].mode()

0    yes
dtype: object

In [109]:
data2['housing'].mode()

0    yes
dtype: object

In [110]:
data1['housing'].replace('unknown', 'yes', inplace = True)
data2['housing'].replace('unknown', 'yes', inplace = True)

In [111]:
data1['loan'].mode()

0    no
dtype: object

In [112]:
data2['loan'].mode()

0    no
dtype: object

In [113]:
data1['loan'].replace('unknown', 'no', inplace = True)
data2['loan'].replace('unknown', 'no', inplace = True)

In [114]:
data1['contact'].mode()

0    cellular
dtype: object

In [115]:
data2['contact'].mode()

0    cellular
dtype: object

In [116]:
data1['contact'].replace('unknown', 'cellular', inplace = True)
data2['contact'].replace('unknown', 'cellular', inplace = True)

In [117]:
data1['month'].mode()

0    may
dtype: object

In [118]:
data2['month'].mode()

0    may
dtype: object

In [119]:
data1['month'].replace('unknown', 'may', inplace = True)
data2['month'].replace('unknown', 'may', inplace = True)

In [120]:
data1['day_of_week'].mode()

0    thu
dtype: object

In [121]:
data2['day_of_week'].mode()

0    thu
dtype: object

In [122]:
data1['day_of_week'].replace('unknown', 'thu', inplace = True)
data2['day_of_week'].replace('unknown', 'thu', inplace = True)

In [123]:
data1['poutcome'].mode()

0    nonexistent
dtype: object

In [124]:
data1['poutcome'].mode()

0    nonexistent
dtype: object

In [125]:
data1['poutcome'].replace('unknown', 'nonexistent', inplace = True)
data2['poutcome'].replace('unknown', 'nonexistent', inplace = True)

In [126]:
data1['y'].mode()

0    no
dtype: object

In [128]:
data2['y'].mode()

0    no
dtype: object

In [129]:
data1['y'].replace('unknown', 'no', inplace = True)
data2['y'].replace('unknown', 'no', inplace = True)

In [130]:
data1.head()

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,30,blue-collar,married,basic.9y,no,yes,no,cellular,may,fri,...,2,999,0,nonexistent,-1.8,92.893,-46.2,1.313,5099.1,no
1,39,services,single,high.school,no,no,no,telephone,may,fri,...,4,999,0,nonexistent,1.1,93.994,-36.4,4.855,5191.0,no
2,25,services,married,high.school,no,yes,no,telephone,jun,wed,...,1,999,0,nonexistent,1.4,94.465,-41.8,4.962,5228.1,no
3,38,services,married,basic.9y,no,yes,no,telephone,jun,fri,...,3,999,0,nonexistent,1.4,94.465,-41.8,4.959,5228.1,no
4,47,admin.,married,university.degree,no,yes,no,cellular,nov,mon,...,1,999,0,nonexistent,-0.1,93.200,-42.0,4.191,5195.8,no

In [131]:
data2.head()

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56,housemaid,married,basic.4y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
1,57,services,married,high.school,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
2,37,services,married,high.school,no,yes,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
3,40,admin.,married,basic.6y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
4,56,services,married,high.school,no,no,yes,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no

The unknown categorical values in our datasets have hence been dealt with.